package j0509;  // 현재 프로젝트의 어떤 패키지(폴더)내에 존재하는 파일인가

// 자바의 명령서를 만드는 영역           
public class First {
	 // 함수, 메소드 => 실행할 기능을 정의해 놓은 영역{} => 영문자 뒤에 ()가 있으면 함수(메소드)
     public static void main(String[] args) {   
		 // main메소드는 따로 사용하지 못한다.. => 마음대로 만들어서 사용하는 이름이 아니다
    	 // 프로젝트내에서 하나의 동작을 필요로 한다
    	 // 하나의 클래스안에서 하나를 만들수 있다.. => 프로그램의 실행과 종료를 나타내는 영역
    	 
    	 // 출력명령어 => 콘솔창에 출력
    	 System.out.println("안녕하세요"); // 괄호안에 출력하고 싶은 값을 넣어준다
    	 
			/* System.out.print("하하하");   ctrl+shift+/ (자동주석)      */
    	 
     
	 }
     /*
     void asdf()
     {
    	 
     }
     */
     
		 
		 
		 
     
     
}
